hrandib/stm8_hal_legacy/timers.h
#pragma once
#include "stm8s.h"
#include "static_assert.h"

namespace Mcudrv
{
	namespace T1
	{
		typedef uint16_t Div;
//TODO: Implement TIM1_SR2
		enum Cfg
		{
//			---=== TIM1_CR1 ===---
			Default = 0,
			CEN = TIM1_CR1_CEN,			// Counter enable
			UDIS = TIM1_CR1_UDIS,		// A UEV is not generated, shadow registers keep their value (ARR, PSC).
										// The counter and the prescaler are re-initialized if the UG bit is set.
			URS = TIM1_CR1_URS,		// An update interrupt request is sent only when the counter reaches the
									// overflow/underflow.
			OPM = TIM1_CR1_OPM,		// One Pulse Mode. Counter stops counting at the next update event (clearing the CEN bit)
			DIR = TIM1_CR1_DIR,		//Direction 0 - Up, 1 - Down
			ARPE = TIM1_CR1_ARPE,	// TIM4_ARR register is buffered through a preload register	

//			---================---			

//		Counter must be in Stop Mode CEN = 0

			EdgeAlign = 0,				// The counter counts up or down depending on the direction bit (DIR)		

//		Encoder mode must be disable (SMS = 0) in center aligned mode	

			CenterAlign1 = 0x01 << 5u,	// The counter counts up and down alternately. Output compare interrupt 
										// flags of channels configured in output (CCiS = 00 in TIM1_CCMRiregisters) are set only when the 
										// counter is counting down.
			CenterAlign2 = 0x02 << 5u,	// The counter counts up and down alternately. Output compare interrupt 
										// flags of channels configured in output (CCiS = 00 in CCMRiregisters) are set only when the counter 
										// is counting up. 
			CenterAlign3 = 0x03 << 5u,	// The counter counts up and down alternately. Output compare interrupt 
										// flags of channels configured in output (CCiS = 00 in TIM1_CCMRiregisters) are set both when the 
										// counter is counting up and down
			
//			---=== TIM1_CR2 ===---

		// Master mode selection
			TrigReset = 0,				// The UG bit from the TIM1_EGR register is used as trigger output (TRGO). If the reset is 
										// generated by the trigger input (clock/trigger mode controller configured in reset mode), the signal on 
										// TRGO is delayed compared to the actual reset.
			TrigEnable = 0x01 << 12u,	// The counter enable signal is used as trigger output (TRGO). It is used to start several 
										// timers or the ADC to control a window in which a slave timer or the ADC is enabled. The counter 
										// enable signal is generated by a logic OR between the CEN control bit and the trigger input when 
										// configured in trigger gated mode. When the counter enable signal is controlled by the trigger input, 
										// there is a delay on TRGO, except if the master/slave mode is selected (see the MSM bit description 
										// in TIM1_SMCR register).
			TrigUpdateEv = 0x02 << 12u,	// The update event is selected as trigger output (TRGO)
			TrigMatch = 0x03 << 12u,		// The trigger output sends a positive pulse when the CC1IF flag is to 
										// be set (even if it was already high), as soon as a capture or a compare match occurs (TRGO).
			TrigComp1 = 0x04 << 12u,		// OC1REF signal is used as trigger output (TRGO)
			TrigComp2 = 0x05 << 12u,		// OC2REF signal is used as trigger output (TRGO)
			TrigComp3 = 0x06 << 12u,		// OC3REF signal is used as trigger output (TRGO)
			TrigComp4 = 0x07 << 12u,		// OC4REF signal is used as trigger output (TRGO)
//			---================---			
			COMS = TIM1_CR2_COMS << 10u,		// 0: When capture/compare control bits are preloaded (CCPC = 1), they are updated by setting the COMG bit. 
										// 1: When capture/compare control bits are preloaded (CCPC = 1), they are updated by setting the 
										// COMG bit or when an rising edge occurs on TRGI.
//		This bit acts only on channels with complementary outputs
			CCPC = TIM1_CR2_CCPC << 8u,		// 0: The CCiE, CCiNE, CCiP, and CCiNP bits in the TIM1_CCERiregisters and the OCiM bit in the TIM1_CCMRiregisters are not preloaded
										// 1: CCiE, CCiNE, CCiP, C CiNP and OCiM bits are preloaded, after having been written, they are 
										// updated only when COMG bit is set in the TIM1_EGR register.
		};

		enum SlaveModeCtrl
		{
//			Default = 0,
			MSM = TIM1_SMCR_MSM,
			//TODO: implement
		};

		enum Ints
		{
			UpdInt = TIM1_IER_UIE,
			Ch1Int = TIM1_IER_CC1IE,
			Ch2Int = TIM1_IER_CC2IE,
			Ch3Int = TIM1_IER_CC3IE,
			Ch4Int = TIM1_IER_CC4IE,
			ComInt = TIM1_IER_COMIE,
			TrigInt = TIM1_IER_TIE,			
			BreakInt = TIM1_IER_BIE
		};
		
		enum Events
		{
			UpdEv = TIM1_EGR_UG,
			Ch1Ev = TIM1_EGR_CC1G,
			Ch2Ev = TIM1_EGR_CC2G,
			Ch3Ev = TIM1_EGR_CC3G,
			TrigEv = TIM1_EGR_TG
		};
		
		enum Channel
		{
			Ch1,
			Ch2,
			Ch3,
			Ch4,
			All_Ch
		};

		enum ActiveLevel
		{
			ActiveHigh,
			ActiveLow
		};

		enum ChannelType
		{
			Output,
			Input,
			InputMap0 = Input,  //ICx is mapped on TI1FPx
			InputMap1,			//ICx is mapped on TI2FPx
			InputMap2			//ICx is mapped on TRC
		};

		enum ChannelCfgIn
		{
			In_NoFilter,
			In_Filt_n2 = 0x01 << 4u,			// 0001: fSAMPLING= fMASTER, N = 2
			In_Filt_n4 = 0x02 << 4u,			// 0010: fSAMPLING= fMASTER, N = 4
			In_Filt_n8 = 0x03 << 4u,			// 0011: fSAMPLING= fMASTER, N = 8 
			In_Filt_div2_n8 = 0x05 << 4u,		// 0101: fSAMPLING= fMASTER/2, N = 8
			In_Filt_div4_n8 = 0x07 << 4u,		// 0111: fSAMPLING= fMASTER/4, N = 8
			In_Filt_div8_n8 = 0x09 << 4u,		// 1001: fSAMPLING= fMASTER/8, N = 8
			In_Filt_div16_n8 = 0x0C << 4u,		// 1100: fSAMPLING= fMASTER/16, N = 8
			In_Filt_div32_n8 = 0x0F << 4u,		// 1111: fSAMPLING= fMASTER/32, N = 8
			//			---================---			
			In_NoPresc = 0,						// 00: no prescaler, capture is done each time an edge is detected on the capture input
			In_Presc_2ev = 0x01 << 2u,			// 01: Capture is done once every 2 events
			In_Presc_4ev = 0x02 << 2u,			// 10: Capture is done once every 4 events
			In_Presc_8ev = 0x03 << 2u,			// 11: Capture is done once every 8 events
		};

