hrandib/stm8_hal_legacy/timers.h
		enum ChannelCfgOut
		{
			OutCompareClear = 0x80,				// OCxCE This bit is used to enable the clearing of the channel x output compare signal (OCxREF) by an 
												// external event on the TIM1_ETR pin (see Section 17.5.9 on page 181).
												// 	0: OC1REF is not affected by the ETRF input signal (derived from the TIM1_ETR pin)
												// 	1: OC1REF is cleared as soon as a high level is detected on ETRF input signal (derived from the 
												// 	TIM1_ETR pin).
//			---================---			
			Out_Frozen = 0,						// 000: Frozen - The comparison between the output compare register TIMx_CCRx and the counter 
			Out_ActiveOnMatch = 0x01 << 4u,		// 001: Set channel x to active level on match. OC1REF signal is forced high when the counter 
												// TIMx_CNT matches the capture/compare register x (TIMx_CCRx).
			Out_InactiveOnMatch = 0x02 << 4u,	// 010: Set channel x to inactive level on match. OC1REF signal is forced low when the counter 
												// TIMx_CNT matches the capture/compare register x (TIMx_CCRx).
			Out_ToggleOnMatch = 0x03 << 4u,		// 011: Toggle - OC1REF toggles when TIMx_CNT=TIMx_CCRx
			Out_ForceInactive = 0x04 << 4u,		// 100: Force inactive level - OCxREF is forced low
			Out_ForceActive = 0x05 << 4u,		// 101: Force active level - OCxREF is forced high
			Out_PWM_Mode1 = 0x06 << 4u,			// 110: PWM mode 1 - In up-counting, channel x is active as long as TIMx_CNT< TIMx_CCRx. 
												// Otherwise, channel x is inactive. In down-counting,channel x is inactive (OCxREF = 0) as long as 
												// TIMx_CNT> TIMx_CCRx. Otherwise, channel x is active (OCxREF = 1).
			Out_PWM_Mode2 = 0x07 << 4u,			// 111: PWM mode 2 - In up-counting, channel x is inactive as long as TIMx_CNT< TIMx_CCRx. Otherwise, channel x is active
			//		---================---			
			Out_PreloadEnable = TIM1_CCMR_OCxPE,	// Preload register on TIMx_CCRx enabled. Read/write operations access the preload register. 
			//		---================---			
			Out_FastEnable = TIM1_CCMR_OCxFE		// This bit is used to accelerate the effect of an event on the trigger in input on the CC output.
													//	0: CC1 behaves normally depending on the counter and CCR1 values, even when the trigger is on. 
													//	The minimum delay to activate CC1 output when an edge occurs on the trigger input, is 5 clock 
													//	cycles.
													//	1: An active edge on the trigger input acts like a compare match on the CC1 output. If this happens, 
													//	OC is set to the compare level irrespective of the result of the comparison. The delay to sample the 
													//	trigger input and to activate CC1 output is reduced to 3 clock cycles. OCFE acts only if the channel 
													//	is configured in PWM1 or PWM2 mode. 
		};

		class Timer1
		{
		public:
			template <uint16_t divider, Cfg config = Default>
			static void Init()
			{
				TIM1->PSCRH = (divider - 1) >> 8UL;
				TIM1->PSCRL = divider - 1;
				TIM1->CR1 = config;
				TIM1->CR2 = config >> 8u;
				TIM1->BKR |= TIM1_BKR_MOE;
			}

			#pragma inline=forced
			static void Enable()
			{
				TIM1->CR1 |= TIM1_CR1_CEN;
			}
			#pragma inline=forced
			static void Disable()
			{
				TIM1->CR1 &= ~TIM1_CR1_CEN;
			}
			#pragma inline=forced
			static void EnableInterrupt(const Ints mask)
			{
				TIM1->IER |= mask;
			}
			#pragma inline=forced
			static void DisableInterrupt(const Ints mask)
			{
				TIM1->IER &= ~mask;
			}
			#pragma inline=forced
			static bool CheckIntStatus(const Ints flag)
			{
				return TIM1->SR1 & flag;
			}
			#pragma inline=forced
			static void ClearIntFlag(const Ints flag)
			{
				TIM1->SR1 &= ~flag;
			}
			#pragma inline=forced
			static void TriggerEvent(const Events ev)
			{
				TIM1->EGR |= ev;
			}
			
			#pragma inline=forced
			static void WriteCounter(const uint16_t c)	//Need to stop Timer
			{
	//			Disable();
				TIM1->CNTRH = c >> 8;
				TIM1->CNTRL = c;
	//			Enable();
			}

			#pragma diag_suppress=Pe940
			static uint16_t ReadCounter()
			{
				__asm("LD A, L:0x525e\n"
						"LD XH, A\n"
						"LD A, L:0x525f\n"
						"LD XL, A\n");
			}
			#pragma diag_default=Pe940
			
			#pragma inline=forced
			static void WriteAutoReload(const uint16_t c)
			{
				TIM1->ARRH = c >> 8;
				TIM1->ARRL = c;
			}

			#pragma inline=forced
			template <Channel Ch, ChannelType type, ChannelCfgIn cfg>
			static void SetChannelCfg()
			{
				BOOST_STATIC_ASSERT(type != Output);
				if(Ch == All_Ch)
				{
					TIM1->CCMR1 = TIM1->CCMR2 = TIM1->CCMR3 = TIM1->CCMR4 = static_cast<uint8_t>(type) | static_cast<uint8_t>(cfg);
				}
				else *reinterpret_cast<volatile uint8_t*>(&TIM1->CCMR1 + Ch) = static_cast<uint8_t>(type) | static_cast<uint8_t>(cfg);
			}

			#pragma inline=forced
			template <Channel Ch, ChannelType type, ChannelCfgOut cfg>
			static void SetChannelCfg()
			{
				BOOST_STATIC_ASSERT(type == Output);
				if(Ch == All_Ch)
				{
					TIM1->CCMR1 = TIM1->CCMR2 = TIM1->CCMR3 = static_cast<uint8_t>(type) | static_cast<uint8_t>(cfg);
				}
				else *reinterpret_cast<volatile uint8_t*>(&TIM1->CCMR1 + Ch) = static_cast<uint8_t>(type) | static_cast<uint8_t>(cfg);
			}
			
			#pragma inline=forced
			template <Channel Ch, ActiveLevel level = ActiveHigh>
			static void ChannelEnable()
			{
				if(Ch == All_Ch)
				{
					TIM1->CCER2 |= TIM1_CCER2_CC3E | (level << 1) | TIM1_CCER2_CC4E | ((level << 1) << 4);
					TIM1->CCER1 |= TIM1_CCER1_CC1E | (level << 1) | TIM1_CCER1_CC2E | ((level << 1) << 4);
				}
				if (Ch == Ch4) TIM1->CCER2 |= TIM1_CCER2_CC4E | ((level << 1) << 4);
				if (Ch == Ch3) TIM1->CCER2 |= TIM1_CCER2_CC3E | (level << 1);
				if (Ch == Ch2) TIM1->CCER1 |= TIM1_CCER1_CC2E | ((level << 1) << 4);
				if (Ch == Ch1) TIM1->CCER1 |= TIM1_CCER1_CC1E | (level << 1);
			}

			#pragma inline=forced
			template <Channel Ch>
			static void ChannelDisable()
			{
				BOOST_STATIC_ASSERT(Ch != All_Ch);
				if (Ch & Ch4 == Ch4) TIM1->CCER2 &= ~(0x0F << 4);
				if (Ch & Ch3 == Ch3) TIM1->CCER2 &= ~0x0F;
				if (Ch & Ch2 == Ch2) TIM1->CCER1 &= ~(0x0F << 4);
				if (Ch & Ch1 == Ch1) TIM1->CCER1 &= ~0x0F;
			}
			
			#pragma inline=forced
			template <Channel Ch, ActiveLevel level = ActiveHigh>
			static void ChannelEnableComplementary()
			{
				BOOST_STATIC_ASSERT(Ch == Ch4);
				if (Ch & Ch3 == Ch3) TIM1->CCER2 |= TIM1_CCER2_CC3NE | (level << 3);
				if (Ch & Ch2 == Ch2) TIM1->CCER1 |= TIM1_CCER1_CC2NE | ((level << 3) << 4);
				if (Ch & Ch1 == Ch1) TIM1->CCER1 |= TIM1_CCER1_CC1NE | (level << 3);
			}
 		
			#pragma inline=forced
			template<Channel Ch>
			static void WriteCompareWord(const uint16_t c)
			{
				*reinterpret_cast<volatile uint8_t*>(&TIM1->CCR1H + Ch * 2) = c >> 8;
				*reinterpret_cast<volatile uint8_t*>(&TIM1->CCR1L + Ch * 2) = c;
			}

			#pragma inline=forced
			template<Channel Ch>
			static void WriteCompareByte(const uint8_t c)
			{
				*reinterpret_cast<volatile uint8_t*>(&TIM1->CCR1L + Ch * 2) = c;
			}

			#pragma inline=forced
			template<Channel Ch>
			static uint16_t ReadCompareWord()
			{
				return *reinterpret_cast<volatile uint16_t*>(&TIM1->CCR1H + Ch * 2);
			}

			#pragma inline=forced
			template<Channel Ch>
			static uint8_t ReadCompareByte()
			{
				return *reinterpret_cast<volatile uint8_t*>(&TIM1->CCR1L + Ch * 2);
			}

			#pragma inline=forced
			template<Channel Ch>
			static volatile uint16_t& GetCompareWord()
			{
				return *reinterpret_cast<volatile uint16_t*>(&TIM1->CCR1H + Ch * 2);
			}

			#pragma inline=forced
			template<Channel Ch>
			static volatile uint8_t& GetCompareByte()
			{
				return *reinterpret_cast<volatile uint8_t*>(&TIM1->CCR1L + Ch * 2);
			}
		}; //Timer1

	} //T1

	namespace T2
	{
		enum Div
			{
				Div1,
				Div2,
				Div4,
				Div8,
				Div16,
				Div32,
				Div64,
				Div128,
				Div256,
				Div512,
				Div1024,
				Div2048,
				Div4096,
				Div8192,
				Div16384,
				Div32768,
			};

		enum Cfg
			{
				Default = 0,
				CEN = TIM2_CR1_CEN,			// Counter enable
				UDIS = TIM2_CR1_UDIS,		// A UEV is not generated, shadow registers keep their value (ARR, PSC).
											// The counter and the prescaler are re-initialized if the UG bit is set.
				URS = TIM2_CR1_URS,		// An update interrupt request is sent only when the counter reaches the
										// overflow/underflow.
				GPbit = TIM2_CR1_OPM,	// General purpose use
				ARPE = TIM2_CR1_ARPE   // TIM2_ARR register is buffered through a preload register
			};

		enum Ints
			{
				UpdInt = TIM2_IER_UIE,
				Ch1Int = TIM2_IER_CC1IE,
				Ch2Int = TIM2_IER_CC2IE,
				Ch3Int = TIM2_IER_CC3IE
			};
		enum Events
		{
			UpdEv = TIM2_EGR_UG,
			Ch1Ev = TIM2_EGR_CC1G,
			Ch2Ev = TIM2_EGR_CC2G,
			Ch3Ev = TIM2_EGR_CC3G
		};

		enum Channel
			{
				Ch1,
				Ch2,
				Ch3,
				All_Ch
			};

