hrandib/stm8_hal_legacy/timers.h
		enum ChannelType
		{
			Output,
			Input,
			InputMap0 = Input,  //ICx is mapped on TI1FPx
			InputMap1,  //ICx is mapped on TI2FPx
		};

		enum ActiveLevel
			{
				ActiveHigh,
				ActiveLow
			};
		
		enum ChannelCfgIn
		{
			In_NoFilter,
			In_Filt_n2 = 0x01 << 4u,			// 0001: fSAMPLING= fMASTER, N = 2
			In_Filt_n4 = 0x02 << 4u,			// 0010: fSAMPLING= fMASTER, N = 4
			In_Filt_n8 = 0x03 << 4u,			// 0011: fSAMPLING= fMASTER, N = 8 
			In_Filt_div2_n8 = 0x05 << 4u,		// 0101: fSAMPLING= fMASTER/2, N = 8
			In_Filt_div4_n8 = 0x07 << 4u,		// 0111: fSAMPLING= fMASTER/4, N = 8
			In_Filt_div8_n8 = 0x09 << 4u,		// 1001: fSAMPLING= fMASTER/8, N = 8
			In_Filt_div16_n8 = 0x0C << 4u,		// 1100: fSAMPLING= fMASTER/16, N = 8
			In_Filt_div32_n8 = 0x0F << 4u,		// 1111: fSAMPLING= fMASTER/32, N = 8
//			---================---			
			In_NoPresc = 0,						// 00: no prescaler, capture is done each time an edge is detected on the capture input
			In_Presc_2ev = 0x01 << 2u,			// 01: Capture is done once every 2 events
			In_Presc_4ev = 0x02 << 2u,			// 10: Capture is done once every 4 events
			In_Presc_8ev = 0x03 << 2u,			// 11: Capture is done once every 8 events
		};

		enum ChannelCfgOut
		{
			Out_Frozen = 0,						// 000: Frozen - The comparison between the output compare register TIMx_CCRx and the counter 
			Out_ActiveOnMatch = 0x01 << 4u,		// 001: Set channel x to active level on match. OC1REF signal is forced high when the counter 
												// TIMx_CNT matches the capture/compare register x (TIMx_CCRx).
			Out_InactiveOnMatch = 0x02 << 4u,	// 010: Set channel x to inactive level on match. OC1REF signal is forced low when the counter 
												// TIMx_CNT matches the capture/compare register x (TIMx_CCRx).
			Out_ToggleOnMatch = 0x03 << 4u,		// 011: Toggle - OC1REF toggles when TIMx_CNT=TIMx_CCRx
			Out_ForceInactive = 0x04 << 4u,		// 100: Force inactive level - OCxREF is forced low
			Out_ForceActive = 0x05 << 4u,		// 101: Force active level - OCxREF is forced high
			Out_PWM_Mode1 = 0x06 << 4u,			// 110: PWM mode 1 - In up-counting, channel x is active as long as TIMx_CNT< TIMx_CCRx. 
												// Otherwise, channel x is inactive. In down-counting,channel x is inactive (OCxREF = 0) as long as 
												// TIMx_CNT> TIMx_CCRx. Otherwise, channel x is active (OCxREF = 1).
			Out_PWM_Mode2 = 0x07 << 4u,			// 111: PWM mode 2 - In up-counting, channel x is inactive as long as TIMx_CNT< TIMx_CCRx. Otherwise, channel x is active
		//		---================---			
			Out_PreloadEnable = 0x01 << 3u,			// Preload register on TIMx_CCRx enabled. Read/write operations access the preload register. 
														// TIMx_CCRx preload value is loaded in the shadow register at each update event.
		};
	
		class Timer2
		{
		public:
			template <Div divider, Cfg config>
			static void Init()
			{
				TIM2->PSCR = divider;
				TIM2->CR1 = config;
			}
		
			#pragma inline=forced
			static void Enable()
			{
				TIM2->CR1 |= TIM4_CR1_CEN;
			}
			#pragma inline=forced
			static void Disable()
			{
				TIM2->CR1 &= ~TIM4_CR1_CEN;
			}
			#pragma inline=forced
			static void EnableInterrupt(const Ints mask)
			{
				TIM2->IER |= mask;
 			}
			#pragma inline=forced
			static void DisableInterrupt(const Ints mask)
			{
				TIM2->IER &= ~mask;
			}
			#pragma inline=forced
			static void TriggerEvent(const Events ev)
			{
				TIM2->EGR |= ev;
			}
			#pragma inline=forced
			static bool CheckIntStatus(const Ints flag)
			{
				return TIM2->SR1 & flag;
			}
			#pragma inline=forced
			static void ClearIntFlag(const Ints flag)
			{
				TIM2->SR1 &= ~flag;
			}
			#pragma inline=forced
			static void WriteCounter(const uint16_t c)	//Need to stop Timer
			{
	//			Disable();
				TIM2->CNTRH = c >> 8;
				TIM2->CNTRL = c;
	//			Enable();
			}
		
			#pragma diag_suppress=Pe940
			static uint16_t ReadCounter()
			{
				__asm("LD A, L:0x530a\n"
					"LD XH, A\n"
					"LD A, L:0x530b\n"
					"LD XL, A\n");
			}
			#pragma diag_default=Pe940

			#pragma inline=forced
			static void WriteAutoReload(const uint16_t c)
			{
				TIM2->ARRH = c >> 8;
				TIM2->ARRL = c;
			}

			#pragma inline=forced
			template <Channel Ch, ChannelType type, ChannelCfgIn cfg>
			static void SetChannelCfg()
			{
				BOOST_STATIC_ASSERT(type != Output);
				if(Ch == All_Ch)
				{
					TIM2->CCMR1 = TIM2->CCMR2 = TIM2->CCMR3 = static_cast<uint8_t>(type) | static_cast<uint8_t>(cfg);
				}
				else *reinterpret_cast<volatile uint8_t*>(&TIM2->CCMR1 + Ch) = static_cast<uint8_t>(type) | static_cast<uint8_t>(cfg);
			}
				
			#pragma inline=forced
			template <Channel Ch, ChannelType type, ChannelCfgOut cfg>
			static void SetChannelCfg()
			{
				BOOST_STATIC_ASSERT(type == Output);
				if(Ch == All_Ch)
				{
					TIM2->CCMR1 = TIM2->CCMR2 = TIM2->CCMR3 = static_cast<uint8_t>(type) | static_cast<uint8_t>(cfg);
				}
				else *reinterpret_cast<volatile uint8_t*>(&TIM2->CCMR1 + Ch) = static_cast<uint8_t>(type) | static_cast<uint8_t>(cfg);
			}
			
			#pragma inline=forced
			template <Channel Ch, ActiveLevel level = ActiveHigh>
			static void ChannelEnable()
			{	
				if(Ch == All_Ch)
				{
					TIM2->CCER2 |= TIM2_CCER2_CC3E | (level << 1);
					TIM2->CCER1 |= TIM2_CCER1_CC1E | (level << 1) | TIM2_CCER1_CC2E | ((level << 1) << 4);
				}
				if (Ch == Ch3) TIM2->CCER2 |= TIM2_CCER2_CC3E | (level << 1);
				if (Ch == Ch2) TIM2->CCER1 |= TIM2_CCER1_CC2E | ((level << 1) << 4);
				if (Ch == Ch1) TIM2->CCER1 |= TIM2_CCER1_CC1E | (level << 1);
			}

			#pragma inline=forced
			template <Channel Ch>
			static void ChannelDisable()
			{
//				BOOST_STATIC_ASSERT(Ch != All_Ch);
				if(Ch == All_Ch)
				{
					TIM2->CCER2 = TIM2->CCER1 = 0;
				}
				if (Ch == Ch3) TIM2->CCER2 &= ~0x0F;
				if (Ch == Ch2) TIM2->CCER1 &= ~(0x0F << 4);
				if (Ch == Ch1) TIM2->CCER1 &= ~0x0F;
			}

			#pragma inline=forced
			template<Channel Ch>
			static void WriteCompareWord(const uint16_t c)
			{
				*reinterpret_cast<volatile uint8_t*>(&TIM2->CCR1H + Ch * 2) = c >> 8;
				*reinterpret_cast<volatile uint8_t*>(&TIM2->CCR1L + Ch * 2) = c;
			}

			#pragma inline=forced
			template<Channel Ch>
			static void WriteCompareByte(const uint8_t c)
			{
				*reinterpret_cast<volatile uint8_t*>(&TIM2->CCR1L + Ch * 2) = c;
			}

			#pragma inline=forced
			template<Channel Ch>
			static uint16_t ReadCompareWord()
			{
				return *reinterpret_cast<volatile uint16_t*>(&TIM2->CCR1H + Ch * 2);
			}

			#pragma inline=forced
			template<Channel Ch>
			static uint8_t ReadCompareByte()
			{
				return *reinterpret_cast<volatile uint8_t*>(&TIM2->CCR1L + Ch * 2);
			}

			#pragma inline=forced
			template<Channel Ch>
			static volatile uint16_t& GetCompareWord()
			{
				return *reinterpret_cast<volatile uint16_t*>(&TIM2->CCR1H + Ch * 2);
			}

			#pragma inline=forced
			template<Channel Ch>
			static volatile uint8_t& GetCompareByte()
			{
				return *reinterpret_cast<volatile uint8_t*>(&TIM2->CCR1L + Ch * 2);
			}
		}; //Timer2
	} //T2

