hrandib/stm8_hal_legacy/timers.h
	namespace T4
	{
			enum Div
			{
				Div1,
				Div2,
				Div4,
				Div8,
				Div16,
				Div32,
				Div64,
				Div128
			};

			enum Cfg
			{
				CEN = TIM4_CR1_CEN,		// CEN Counter enable
				UDIS = TIM4_CR1_UDIS,	// UDIS  A UEV is not generated, shadow registers keep their value (ARR, PSC).
										//The counter and the	prescaler are re-initialized if the UG bit is set.
				URS = TIM4_CR1_URS,		// URS an update interrupt request is sent only when the counter reaches the
										//overflow/underflow.
				OPM = TIM4_CR1_OPM,
				ARPE = TIM4_CR1_ARPE	//ARPE TIM4_ARR register is buffered through a preload register
			};

		class Timer4
		{
		public:
			template <Div Divider, Cfg Config>
			static void Init()
			{
				TIM4->PSCR = Divider;
				TIM4->CR1 = Config;
			}
			static void Enable()
			{
				TIM4->CR1 |= TIM4_CR1_CEN;
			}
			static void Disable()
			{
				TIM4->CR1 &= ~TIM4_CR1_CEN;
			}
			static void Clear()
			{
				TIM4->CNTR = 0;
			}
			static void EnableInterrupt() // Only one interrupt on that vector (Update)
			{
				TIM4->IER |= TIM4_IER_UIE;
			}
			static void DisableInterrupt()
			{
				TIM4->IER &= ~TIM4_IER_UIE;
			}
			static bool CheckIntStatus()		
			{
				return TIM4->SR1 & TIM4_SR1_UIF;
			}
			static void ClearIntFlag()
			{
				TIM4->SR1 &= ~TIM4_SR1_UIF;
			}
			static void WriteCounter(uint8_t c)
			{
				TIM4->CNTR = c;
			}
			#pragma inline=forced
			static uint8_t ReadCounter()
			{
				return TIM4->CNTR;
			}
			static void WriteAutoReload(uint8_t c)
			{
				TIM4->ARR = c;
			}
		};
	} //T4

	namespace Wdg
	{
		enum Period
		{
			P_16ms,
			P_32ms,
			P_64ms,
			P_128ms,
			P_256ms,
			P_512ms,
			P_1s
		};
		
		class Iwdg
		{
		public:
			#pragma inline=forced
			static void Enable(const Period period)
			{
				IWDG->KR = 0xCC;
				IWDG->KR = 0x55;
				IWDG->RLR = 0xFF;
				IWDG->PR = period;
			}
			#pragma inline=forced
			static void Refresh()
			{
				IWDG->KR = 0xAA;
			}
		};
	}
}
